# Aula 6: Estruturação do banco e JOINs;

## PROJETO

- Duplinha ou não;
- Escolha um dataset de sua preferência (Kaggle, UCI,...);
- https://www.kaggle.com/datasets;
- https://archive.ics.uci.edu/datasets;
- Coloque-o no postgres (como? ...) (DESAFIO); 
- ter mais de uma tabela (necessario joins)
- Usando o Jupyter notebook, faça uma análise descritiva;
    - Qual as tipagens das colunas?;
    - Quantos nulos temos em cada coluna?;
    - Quantos valores únicos temos nas colunas categoricas?;
    - ...;
- Ainda no Jupyter, faça 10 perguntas ao seu dataset e responda-as com querys;
    - Qual o top 10 vendas?;
    - Qual o top 5 clientes?;
    - Qual medida é minoria?;
    - ...;
- Organize tudo em um relatório em arquivo jupyter e ou envie o HTML no LMS ou disponibilize o link do GitHub também no LMS.;
- Entregar até dia 15/03 as 23h59
aruams@gmail.com

# Integridade entre as tabelas:

- PRIMARY KEY;
- FOREIGN KEY;
- ON UPDATE CASCADE;
- ON DELETE CASCADE;

# Agora sim podemos criar toda a base com o arquivo comandos_postgre.sql

In [13]:
from sqlalchemy import create_engine
import pandas as pd 
import pandasql as ps
# SGBD://USER:SENHA@HOST/DATABASE

engine = create_engine('postgresql+psycopg2://arua:admin@localhost/postgres')
conn = engine.connect()

In [14]:
query = "SELECT * FROM ada.transacoes LIMIT 10"

pd.read_sql_query(query, con = engine)

   id_transacao  id_aluno  id_curso  id_vendedor  id_pagamento
0             1         1         1            1             1
1             2         2         1            2             2
2             3         3         1            1             2
3             4         4         1            2             1
4             5         5         1            1             3
5             6         6         1            1             3
6             7         7         1            2             1
7             8         8         1            2             1
8             9         9         2            1             4
9            10        10         2            2             4

In [15]:
query = "SELECT * FROM ada.vendedores"

pd.read_sql_query(query, con = engine)

   id_vendedor vendedor
0            1    paulo
1            2  adriana
2            3    nadir

In [16]:
# conectem a tabela de transações com a tabela de vendedores
query = """
SELECT 
    *
FROM 
ada.transacoes AS t
LEFT JOIN ada.vendedores AS v 
ON t.id_vendedor = v.id_vendedor
LIMIT 5
"""

pd.read_sql_query(query, con = engine)

,id_transacao,id_aluno,id_curso,id_vendedor,id_pagamento,id_vendedor,vendedor
0,1,1,1,1,1,1,paulo
1,2,2,1,2,2,2,adriana
2,3,3,1,1,2,1,paulo
3,4,4,1,2,1,2,adriana
4,5,5,1,1,3,1,paulo

In [20]:
query = """
SELECT 
    t.id_transacao,
    v.id_vendedor
FROM 
ada.transacoes AS t
LEFT JOIN ada.vendedores AS v 
ON t.id_vendedor = v.id_vendedor
LIMIT 5

"""

pd.read_sql_query(query, con = engine)

   id_transacao  id_vendedor
0             1            1
1             2            2
2             3            1
3             4            2
4             5            1

---

## Bem vindo ao GROUP BY

GROUP BY 

Funções possíveis: 

- SUM(nome_coluna) -> Soma dos valores
- AVG(nome_coluna) -> Média dos valores
- MIN(nome_coluna) -> Valor mínimo
- MAX(nome_coluna) -> Valor máximo
- COUNT(nome_coluna) -> Contagem

In [27]:
# quanto é o valor acumulado de venda por curso?
query = """
SELECT
    c.curso,
    SUM(c.valor_curso)
FROM ada.transacoes AS t
LEFT JOIN ada.cursos AS c ON t.id_curso = c.id_curso
GROUP BY c.curso
"""

df = pd.read_sql_query(query, con = engine)
print(df.shape)
df

(4, 2)

              curso    sum
0   arquiteto dados  400.0
1     ciencia dados  910.0
2     analise dados  400.0
3  engenharia dados  480.0

1) Quantos cursos cada vendedor vendeu?

In [29]:
query = """
SELECT v.vendedor,
    COUNT(v.id_vendedor)
FROM ada.transacoes AS t
LEFT JOIN ada.vendedores as v
ON t.id_vendedor = v.id_vendedor
LEFT JOIN ada.cursos AS c
ON t.id_curso = c.id_curso

GROUP BY vendedor
"""

df = pd.read_sql_query(query, con = conn)
df

  vendedor  count
0    paulo     14
1    nadir      7
2  adriana     13

2) Qual o montante vendido por cada vendedor,~~QUE  SEJA MAIOR QUE 500?~~

In [36]:
# Conecte o curso a tabela de transações
query = """
SELECT v.vendedor,
    SUM(c.valor_curso)
FROM ada.transacoes AS t
LEFT JOIN ada.vendedores as v
ON t.id_vendedor = v.id_vendedor
LEFT JOIN ada.cursos AS c
ON t.id_curso = c.id_curso

GROUP BY vendedor


"""

df = pd.read_sql_query(query, con = engine)
df

  vendedor    sum
0    paulo  860.0
1    nadir  410.0
2  adriana  920.0

In [ ]:
# quanto de cada curso cada vendedor vendeu, e quanto foi o valor total?

In [63]:
query = """
SELECT v.vendedor,
    c.curso,
    SUM(c.valor_curso),
    COUNT(t.id_transacao)
FROM ada.transacoes AS t
LEFT JOIN ada.vendedores as v
ON t.id_vendedor = v.id_vendedor
LEFT JOIN ada.cursos AS c
ON t.id_curso = c.id_curso

GROUP BY v.vendedor, c.curso

ORDER BY v.vendedor, c.curso
"""

df = pd.read_sql_query(query, con = engine)
df

  vendedor             curso    sum  count
0  adriana   arquiteto dados  400.0      5
1  adriana     ciencia dados  280.0      4
2  adriana  engenharia dados  240.0      4
3    nadir     analise dados  200.0      4
4    nadir     ciencia dados  210.0      3
5    paulo     analise dados  200.0      4
6    paulo     ciencia dados  420.0      6
7    paulo  engenharia dados  240.0      4

In [56]:
# Conecte o curso a tabela de transações
query = """
SELECT  
    t.id_vendedor, 
    v.vendedor, 
    SUM(c.valor_curso)
FROM ada.transacoes AS t 
LEFT JOIN ada.vendedores AS v 
ON v.id_vendedor = t.id_vendedor
LEFT JOIN ada.cursos AS c 
ON t.id_curso = c.id_curso

GROUP BY 1, 2
"""

df = pd.read_sql_query(query, con = engine)
df

   id_vendedor vendedor    sum
0            1    paulo  860.0
1            3    nadir  410.0
2            2  adriana  920.0

# Exercício 1:

Construa a tabela inicial sem a normalização.

In [79]:
query = """
SELECT
    -- TRANSACOES
    t.id_transacao,

    -- CURSOS
    t.id_curso,
    c.curso,
    c.valor_curso,

    -- ALUNOS
    t.id_aluno,
    a.primeiro_nome, 
    a.ultimo_nome,
    a.cpf,
    a.data_ingresso, 
    a.endereco, 
    a.numero, 
    a.telefone_a, 
    a.telefone_b, 

    -- CIDADES
    a.id_cidade, 
    ci.cidade,
    ci.estado,

    -- VENDEDORES
    t.id_vendedor,
    v.vendedor,

    -- PAGAMENTOS
    t.id_pagamento,
    p.pagamento
FROM ada.transacoes AS t
LEFT JOIN ada.cursos AS c
    ON t.id_curso = c.id_curso
LEFT JOIN ada.alunos AS a
    ON t.id_aluno = a.id_aluno
LEFT JOIN ada.vendedores AS v
    ON t.id_vendedor = v.id_vendedor
LEFT JOIN ada.cidades AS ci
    ON a.id_cidade = ci.id_cidade
LEFT JOIN ada.pagamentos p
    ON t.id_pagamento = p.id_pagamento
"""

dd = pd.read_sql_query(query, con = engine)
dd.head()

,id_transacao,id_curso,curso,valor_curso,id_aluno,primeiro_nome,ultimo_nome,cpf,data_ingresso,endereco,numero,telefone_a,telefone_b,id_cidade,cidade,estado,id_vendedor,vendedor,id_pagamento,pagamento
0,1,1,engenharia dados,60.0,1,abelar,henrique,68740550196,2023-03-05,Rua da Penha,3300,866862753,274845545,1,curitiba,PR,1,paulo,1,a vista
1,2,1,engenharia dados,60.0,2,adriano,gambetta,34146481132,2023-03-06,Rua Henrique Soares,7118,273807947,0,1,curitiba,PR,2,adriana,2,credito
2,3,1,engenharia dados,60.0,3,alex,moulin,12728282203,2023-03-07,Rua Leodécio Santiago de Souza,6082,872235320,911955261,1,curitiba,PR,1,paulo,2,credito
3,4,1,engenharia dados,60.0,4,álvaro,fonseca,43764914607,2023-03-08,Rua Pitica,7924,938535574,262020598,1,curitiba,PR,2,adriana,1,a vista
4,5,1,engenharia dados,60.0,5,andre,melchior,23228327392,2023-03-09,Rua Camilo Paula,4160,189494206,323561018,2,sao paulo,SP,1,paulo,3,pix

### Exercício 2:

Realize uma query com a média do recebido por curso

### Exercício 3: 

Realize uma query que calcule o quanto foi recebido de alunos que começam com a letra A;

### Exercício 4: 

Realize uma query que calcule quanto foi recebido de cada cidade


E se eu quiser ver resultados acima de um valor específico? Como filtro o Group By?

In [86]:
# Conecte o curso a tabela de transações
query_1 = """

"""

df = pd.read_sql_query(query_1, con = conn)
df

      sum
0  1250.0

In [87]:
# SUBQUERY

query = """
WITH tabela_1 AS 
(    SELECT  
        ci.id_cidade, 
        SUM(c.valor_curso) AS soma
    FROM ada.transacoes AS t 
    LEFT JOIN ada.alunos AS a ON t.id_aluno = a.id_aluno
    LEFT JOIN ada.cidades AS ci ON a.id_cidade = ci.id_cidade
    LEFT JOIN ada.cursos AS c ON c.id_curso = t.id_curso
    GROUP BY ci.id_cidade

    HAVING  SUM(c.valor_curso) >= 200
),
tabela_2 AS (
    SELECT * FROM show
)

SELECT 
    AVG(soma)
FROM tabela_1
LEFT JOIN tabela_2 ON asdkfjhasldfkahsd

"""

df = pd.read_sql_query(query, con = conn)
df

     avg
0  312.5

### Exercício 5:

Realize uma query que calcule o quanto foi recebido por cada estado.

In [71]:
query = """

"""

df = pd.read_sql_query(query, con = conn)
df

  upper  acumulado
0    PR      520.0
1    MG      500.0
2    BA      490.0
3    RO      440.0
4    SP      240.0

### Exercício 6:

Realize queryes para saber quem trouxe mais dinheiro: pessoas com dois telefones ou com um telefone?

### Exercício 7:

Realize uma query para saber qual foi o lucrado total por cada vendedor

### Exercício 8:

Realize uma query para saber o valor médio das vendas de cada vendedor

### Exercicio 9:

Qual vendedor vendeu mais cursos?

### Exercício 10: 

Quais os tipos de pagamentos mais usado por cada vendedor?

### Exercício 11: 

Quais tipos de pagamentos são mais utilizados?

### Exercício 12: 

Quais pagamentos levantam mais montante de dinheiro?

### Exercício 13:

Quais pagamentos apresentam os maiores valores médio?

### Exercício 14:

Quais as cidades que cada vendedor atua mais?

### Exercício 15: 

Qual o curso preferido de cada cidade?

### Exercício 16:

Qual o montante mensal recebido?

### Exercício 17:

Qual a média mensal recebida?

### Exerício 18: 

Dos alunos com dois telefones, qual montante levantado por cada tipo de pagamento?

### Exercício 19: 

Quais os cursos mais frequentes e quais os montates levantados pelos alunos que contém a letra G no nome?

### Exercício 20: 

Quantos alunos temos por cada cidade? Mais alunos na cidade significa maior montante gerado pela cidade?